export const CAREER_CONSTANTS = [
  {
    id: '2021-03',
    date: '2021年3月',
    description:
      '私立4年制大学を卒業。卒業研究ではPythonを活用し、コロナ禍における買い占め現象のデータ分析を行う。在学中に個人事業主として開業。',
  },
  {
    id: '2021-04',
    date: '2021年4月 ~ 2022年2月',
    description:
      '大学卒業後、個人事業主として活動を本格的に開始。この期間にPythonを独学で勉強し、WebスクレイピングやPyAutoGUIを使った業務効率化ツールを開発。この期間に食事・運動・睡眠など健康に関する書籍を読み漁る。',
  },
  {
    id: '2022-03',
    date: '2022年3月 ~ 2022年10月',
    description:
      '一度でもいいから今後絶対に選ばないであろう異業種の経験を積むため、薬品の製造工場に就職。しかし同年7月に椎間板ヘルニアを発症し動けなくなってしまったため10月に退職。',
  },
  {
    id: '2022-11',
    date: '2022年11月 ~ 2023年3月',
    description:
      '椎間板ヘルニアの回復後、友人の紹介で都内のSI企業に就職し、流通業界の会計システムプロジェクトに結合テストから参加。業界未経験ながらExcelとPythonを活用した業務効率化に取り組む。',
  },
  {
    id: '2023-03',
    date: '2023年3月 ~ ',
    description:
      '案件変更を経て、流通業界の店内システムのクラウド移行プロジェクトに参画。要件定義から参画し設計や結合テスト、システムテストを経て現在に至る(2024年12月)。',
  },
];
